{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Neo4j + Python [1]\n",
    "\n",
    "## Instalacion\n",
    "\n",
    "Para instalar ejecutan el siguiente comando\n",
    "`pip install neo4j`\n",
    "\n",
    "## Ejecucion desde Python\n",
    "\n",
    "A continuacion configuran la cadena de conexion y verifican que este correctamente instalado la libreria si genera un error de seguridad TTL [4] agregar 'encrypted=False'\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "class HelloWorldExample(object):\n",
    "\n",
    "    def __init__(self):\n",
    "        self._driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"manager\"), encrypted=False)\n",
    "\n",
    "    def close(self):\n",
    "        self._driver.close()\n",
    "\n",
    "    def print_greeting(self, message):\n",
    "        with self._driver.session() as session:\n",
    "            greeting = session.write_transaction(self._create_and_return_greeting, message)\n",
    "            print(greeting)\n",
    "    def imprimir_nodos(self):\n",
    "        with self._driver.session() as session:\n",
    "            resultado = session.write_transaction(self._consultar_nodos)\n",
    "            for res in resultado:\n",
    "                print(res['mensaje'])\n",
    "\n",
    "    @staticmethod\n",
    "    def _create_and_return_greeting(tx, message):\n",
    "        result = tx.run(\"CREATE (a:Greeting) \"\n",
    "                        \"SET a.message = $message \"\n",
    "                        \"RETURN a.message + ', from node ' + id(a)\", message=message)\n",
    "        return result.single()[0]\n",
    "    @staticmethod\n",
    "    def _consultar_nodos(tx):\n",
    "        result = tx.run(\"match (p:Greeting) return p.message AS mensaje\")\n",
    "        return result\n",
    "grafo=HelloWorldExample()\n",
    "grafo.print_greeting(\"UPS Cuenca !!!\")\n",
    "grafo.imprimir_nodos()\n",
    "grafo.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Neomodel\n",
    "`pip install neomodel`\n",
    "Configurar en base de modelos para gestionar los nodos con neomodel\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neomodel import StructuredNode, StringProperty, RelationshipTo, RelationshipFrom, config\n",
    "from neomodel import db\n",
    "config.DATABASE_URL = 'bolt://neo4j:manager@localhost:7687'\n",
    "config.ENCRYPTED_CONNECTION = False\n",
    "\n",
    "class Book(StructuredNode):\n",
    "    title = StringProperty(unique_index=True)\n",
    "    author = RelationshipTo('Author', 'AUTHOR')\n",
    "\n",
    "class Author(StructuredNode):\n",
    "    name = StringProperty(unique_index=True)\n",
    "    books = RelationshipFrom('Book', 'AUTHOR')\n",
    "    \n",
    "    def libros(self):\n",
    "        results, meta = db.cypher_query(\"MATCH (a)-[:AUTHOR]->(b) RETURN b\")\n",
    "        return [Author.inflate(row[0]) for row in results]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "J. K. Rowling\n",
      "[<Author: {'name': 'J. K. Rowling', 'id': 76}>]\n"
     ]
    }
   ],
   "source": [
    "# harry_potter = Book(title='Harry potter and the..').save()\n",
    "#rowling =  Author(name='J. K. Rowling').save()\n",
    "#harry_potter.author.connect(rowling)\n",
    "a = Author()\n",
    "resultado = a.libros()\n",
    "for r in resultado:\n",
    "    print(r.name)\n",
    "print(resultado)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'a.name': 'Michael Sherman', 'a.born': None},\n",
       " {'a.name': 'Zoltan Varju', 'a.born': None},\n",
       " {'a.name': 'Peter Neubauer', 'a.born': None},\n",
       " {'a.name': 'Grace Andrews', 'a.born': None}]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Node, Relationship, Graph\n",
    "\n",
    "# connect to authenticated graph database\n",
    "graph = Graph(\"bolt://localhost:7687\", aut=\"neo4j\", password=\"manager\", secure=False)\n",
    "\n",
    "tx = graph.begin()\n",
    "a = Node(\"Person\", name=\"Alice\")\n",
    "tx.create(a)\n",
    "b = Node(\"Person\", name=\"Bob\")\n",
    "ab = Relationship(a, \"KNOWS\", b)\n",
    "tx.create(ab)\n",
    "tx.commit()\n",
    "# graph.exists(db) # Generar un error de tipo de parametro en base a la version del Neo4j pero si podemos ejecutar consultas como se ve en la siguiente linea\n",
    "graph.run(\"MATCH (a:Person) RETURN a.name, a.born LIMIT 4\").data()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Bibliografia\n",
    "\n",
    "[1] https://neo4j.com/developer/python/\n",
    "[2] https://github.com/technige/py2neo/issues/791\n",
    "[3] https://py2neo.org/v4/database.html\n",
    "[4] https://stackoverflow.com/questions/60023381/securityerror-failed-to-establish-secure-connection-to-eof-occurred-in-violati"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
